// 1. Создать глобальную переменную типа int с именем a

int a = 0;

// 2. Создать локальную переменную типа double с именем b

 void main2 (){
  double b = 0.12;
 }

// 3. Создать строковую переменную с именем text  при помощи var, попытаться присвоить переменной a. Каков результат?

  var text = 'kjguy';

  // 4. Создать переменную  с именем dyn при помощи dynamic, проинициализировать его целочисленным значением, 
  //далее попытаться присвоить переменной строковое значение переменной text. Каков результат? Почему?
  void main() {
    dynamic name = "Tom";
    print(name);
    name =  45;
    print(name);

   dynamic dyn = 12;
   dyn = text;
   print(dyn);
}

  // 5. Создать переменную с именем fin  при помощи final и con при помощи const, попытаться изменить переменные, 
  //посмотреть результат. В чем отличия final от const?

  final fin = 45;
  //fin = 60;
  const con = 90;
  //con = 92;
 
// 6. Создать числовую переменную с именем a проверить является ли число четным.

void gogogo () {
  int four = 4;
  print(four);
}
